{
    "education": {
        "cmu": {
            "title": "Central Michigan University",
            "location": "Mount Pleasant MI",
            "dates": "Graduation: August 2023",
            "major": "Bachelor's of Science in Computer Science",
            "minor": "Minor in Mathematics"
        },
        "springboard": {
            "title": "Springboard Cybersecurity Career Track",
            "dates": "Completion: June 2025",
            "info": [
                "Developed an adversarial mindset by learning to identify common web application vulnerabilities (OWASP Top 10) and implementing secure coding practices to prevent them.",
                "Gained hands-on experience in vulnerability assessment and threat modeling through 50+ technical labs, providing critical context for building secure back-end services and defending against common attack vectors.",
                "Completed an intensive, project-based curriculum focused on defensive security principles, application security, secure coding practices, and cloud security fundamentals."
            ]
        }
    },
    "experience": {
        "24g": {
            "title": "Software Development Intern",
            "company": "24g",
            "location": "Troy MI",
            "dates": "January 2022 - August 2022",
            "info": [
                "Served as the primary frontend developer for multiple client projects, rigorously translating UI/UX mockups into fully functional, pixel-perfect Vue.js interfaces.",
                "Independently executed the frontend logic for smaller-scale applications, delivering interactive and bug-free components ready for integration.",
                "Collaborated with backend teams to consume RESTful APIs, ensuring accurate data rendering and seamless user interactions.",
                "Implemented complex UI animations and micro-interactions for convention applications, directly translating client requests into working code."
            ]
        }
    }
}
